Revit 2027 API
NurbsSurfaceData.GetKnotsU Method
 Get the list of knots in the u-direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<double> GetKnotsU()
Public Function GetKnotsU As IList(Of Double)
public:
IList<double>^ GetKnotsU()
member GetKnotsU : unit -> IList<float>
Return Value
IList<Double>
See Also
Reference
NurbsSurfaceData Class
Autodesk.Revit.DB Namespace